#+FILETAGS: REFILE
* TODO publish ebooks
 Added:<2019-12-12 Thu 06:51>
* NEXT setup the citation system using org-ref
:LOGBOOK:
CLOCK: [2019-12-25 Wed 19:53]--[2019-12-29 Sun 13:15] => 89:22
CLOCK: [2019-12-24 Tue 22:51]--[2019-12-25 Wed 00:27] =>  1:36
CLOCK: [2019-12-23 Mon 22:04]--[2019-12-24 Tue 21:57] => 23:53
CLOCK: [2019-12-20 Fri 22:00]--[2019-12-23 Mon 22:03] => 72:03
CLOCK: [2019-12-19 Thu 22:37]--[2019-12-20 Fri 22:00] => 23:23
CLOCK: [2019-12-14 Sat 22:16]--[2019-12-19 Thu 22:36] => 120:20
CLOCK: [2019-12-14 Sat 15:21]--[2019-12-14 Sat 22:13] =>  6:52
CLOCK: [2019-12-12 Thu 06:52]--[2019-12-14 Sat 15:07] => 56:15
:END:
 Added:<2019-12-12 Thu 06:52>

 Using [[https://github.com/jkitchin/org-ref/blob/master/org-ref.org][org-ref/org-ref.org by jkitchin]] , I set up a citation system.
#+begin_example
bibliography:~/Dropbox/research_library/zcl.bib
bibliographystyle:unsrt
#+end_example
This two lines are must at the end of the org file.
* TODO mdframed package
:LOGBOOK:
CLOCK: [2019-12-14 Sat 22:13]--[2019-12-14 Sat 22:16] =>  0:03
:END:
 Added:<2019-12-14 Sat 22:13>

a beautiful theorem environment package

[[https://ctan.org/pkg/mdframed?lang=en][CTAN: Package mdframed]]
* TODO external link links to my own course
:LOGBOOK:
CLOCK: [2020-01-29 Wed 06:58]--[2020-01-29 Wed 06:59] =>  0:01
:END:
 Added:<2020-01-29 Wed 06:58>
* DONE drop down menu
CLOSED: [2020-01-29 Wed 07:14]
:LOGBOOK:
- CLOSING NOTE [2020-01-29 Wed 07:14] \\

  By adding the following in the menus.toml

  [[main]]
    name = "STEAM"
    identifier="parent1"
    weight = 33

  [[main]]
    name = "Science"
    parent="parent1"
    url = "#msc_courses"
    weight = 1
  [[main]]
    name = "Technology"
    parent="parent1"
    url = "#msc_courses"
    weight = 2
  [[main]]
    name = "Engineering"
    parent="parent1"
    url = "#msc_courses"
    weight = 3
  [[main]]
    name = "Art"
    parent="parent1"
    url = "#msc_courses"
    weight = 4
  [[main]]
    name = "Math"
    parent="parent1"
    url = "#msc_courses"
    weight = 5
:END:
 Added:<2020-01-29 Wed 06:59>
* TODO start a issue
:LOGBOOK:
CLOCK: [2020-01-29 Wed 21:03]--[2020-01-29 Wed 21:04] =>  0:01
:END:
 Added:<2020-01-29 Wed 21:03>

 ## Actual Behavior

I use the begin_src and end_src block to export tomal tables of table as you mentioned in the manual  https://ox-hugo.scripter.co/doc/custom-front-matter/

But no extra font matter export as expected


## How to Reproduce the Issue
My Org-version is 9.2.6
and ox-hugo is the same as 20200122 which is now avaiable at melpa
Emacs 26.3 I use spacemace at the master branch which is stable.


### Example Org File
```
** TODO test 2
   :PROPERTIES:
   :EXPORT_FILE_NAME: index
   :LATEX_TITLE: test 2
   :EXPORT_HUGO_SECTION: project
   :EXPORT_HUGO_BUNDLE: test-2
   :EXPORT_DESCRIPTION: summary of this test.
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :url_pdf "#"
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :url_code "#"
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :url_dataset "#"
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :url_video "#"
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :external_link "/courses/example/"
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :projects '("signals and systems")
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :image '((caption . " [**Watch**](https://youtube.com)") (preview_only . "true"))
   :END:
   :LOGBOOK:
   CLOCK: [2020-01-29 Wed 16:39]--[2020-01-29 Wed 16:50] =>  0:11
   :END:
 <2020-01-29 Wed 16:39>

#+begin_src toml :front_matter_extra t
[[links]]
icon = "youtube"
icon_pack = "fab"
name = "Watch It"
url = "/courses/example/"

[[links]]
icon = "instagram"
icon_pack = "fab"
name = "Inst"
url = "/courses/example/"

[[links]]
icon = "weibo"
icon_pack = "fab"
name = "Weibo"
url = "/courses/example/"

[[links]]
icon = "wechat"
icon_pack = "fab"
name = "Wechat"
url = "/courses/example/"
#+end_src


Thanks for your help.
* TODO issue ox-hugo
 Added:<2020-01-30 Thu 16:53>

I walkaround this problem by using the methods mentioned here:

https://github.com/gcushen/hugo-academic/issues/682

In summary, two steps:
1. define [[main.menu]] in menus.toml as

```
[[main.menu]]
  name = "Teaching"
  url= "/courses/"
```
2. use

```
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :menu.signalsandsystems '((parent . "chapter 4 advanced problems") (weight . "1") )
```
in the property of subtree, and the front-matter will be exported as

```
[menu.signalsandsystems]
  parent = "chapter 3 advanced problems"
  weight = 2.0
```

Sir, If you find it difficult to support toml table, I am ok with the method metioned above.

Now, I am happy.
* TODO draw mindmap and use it as cover
:LOGBOOK:
CLOCK: [2020-02-02 Sun 06:56]--[2020-02-02 Sun 06:57] =>  0:01
:END:
 Added:<2020-02-02 Sun 06:56>
* TODO Emacs python notebook
Added:<2020-02-10 Mon 10:08>
* TODO html footer
 Added:<2020-02-10 Mon 10:12>
* TODO org to beamer and reveal.js
 Added:<2020-02-12 Wed 07:55>
* TODO [#A] 深入理解浏览器
[2020-02-16 Sun 05:34]

浏览器的工作原理，可能涉及到计算机网络，html css js
* TODO 更新 manim
[2020-02-16 Sun 05:59]

1. tensor
2. abstract algebra and complex analysis. topology, algebraic geometry.
   topology, algebraic geometry
3. z-transform and the laplace transform
4. information theory
5. manifolds
6. ordinary deferential equations.
7. Stochastic processes and applications to ML/AI and Finance
8. homomorphic encryption
9. Elliptic curves cryptography
10. traveling salesman or number partition problem
11. Measure theory
12. permutations
13. encryption/cryptography
14. set theory and trigonometry
15. essense of statistics
16. math for quantum computing
17. math for data science
18. millennium prize problems
19. concepts in galois theory
20. basic data structure/algorithms such sorting/searching/balanced binary
    trees/heaps/hash tables/linear programming
21. outer algebra as an extension of the linear algebra
22. Feigenbaum constant/Chaos theory
23. Matrix analysis Toplietz matrix
24. line and surface integrals(Green's and Stokes theorem)
25. Geometric Algebra
* TODO problems in signals and systems
:LOGBOOK:
CLOCK: [2020-02-19 Wed 21:23]--[2020-02-19 Wed 21:25] =>  0:02
:END:
 Added:<2020-02-19 Wed 21:23>

| chapter | number |
|---------+--------|
|       2 |     73 |
|       3 |     71 |
|       4 |     53 |
|       5 |     56 |
|       6 |     66 |
|       7 |     52 |
|       8 |     49 |
|       9 |     65 |
|      10 |     66 |
|      11 |     60 |
